// pages/zyyh/zyyh.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    articlelist:[
      {
        title:"饮食健发",
        content:`日常饮食宜多样化，合理搭配，保持体内酸碱平衡，对于健发、美发，防止头发早衰有重要作用。可适量食用含蛋白质、碘钙、维生素B、A、E等较丰富的天然食物，如：鲜奶、鱼、蛋类、豆类、绿色蔬菜、瓜果、粗粮等。同时，可根据情况适当选用健发营养食品。例如，仙人粥（《遵生八笺》）：取何首乌、白米适量，用砂锅煮粥，常服。有补肝肾、益气血、乌发驻颜之效。芝麻核桃糖蘸（《药膳食谱集锦》）：赤砂糖500g，黑芝麻、核桃仁各250g，加工制作成糖蘸。日服数小块，可健脑补肾，乌须黑发。经常服用，又可防治神经衰弱、健忘、头发早白、脱发等症。`
      },
      {
        title:"药物美发",
        content:`以中医基本理论为指导，运用中药进行美发保健，也是常用的一种有效方法。药物美发既有美发保健作用，又有健发治疗作用。美发药品又可分为外用和内服两类。

        1、外用类　根据不同情况选用相应的中药洗浴头发，直接作用于皮肤组织和头发，以达到健发目的。外用药物有润发、洁发、香发、茂发、乌发，防治脱发等作用。古代医家和养生家在这方面有很多记载，现仅举几例。①猪胆汁说法（《普剂方》）：猪胆一枚，取胆汁倾水中，或将猪胆置于乳香油中浸七日以上。用水洗头，待发干后适量抹猪胆汁及乳香油。本法有清热祛风，润发生辉之效。②香发散（《慈禧太后医方选议》）：零陵香30g，辛夷15g，玫瑰花15g，檀香18g，川大黄12g，甘草12g，丹皮12g，山奈9g，丁香9g，细辛9g，苏合香油9g，白芷9g。研药为细末，用苏合香油搅匀，晾干。药面糁发上，蓖去。本方有洁发香发作用，久用发落重生，至老不白。③令发不落方（《慈禧光绪医方选议》）：榧子三个，胡桃二个，侧柏叶30g，共捣烂，浸泡雪水内。用浸液洗发。本方有止发落、令发黑润之效，尤其对血热发落有良效。
        
        2、内服类　根据辨证施治的原则，配制成不同剂型，经口服而达到美发的目的。它主要通过调整整体机能，促进气血运行，而起到健发作用。具有健发作用的中药很多，例如，胡麻、油菜子、榴花、核桃、椰子浆、猕猴桃、槐实、桑椹、黑大豆等。内服药也有很多剂型，如汤剂、膏剂、酒剂、丹剂、丸剂等，可以选择地用。瓜子散（《千金翼方》）：瓜子、白芷、当归、川芎、炙甘草各60g，煎药为散，饭后服1g左右，日3次，酒浆汤饮，经常服用有活血补血，美发荣肤作用，可防衰抗老，预防头发早白。地黄酒、黄精酒、枸杞酒等，皆有补虚通血脉，使白发变黑之效。七宝美髯丹、首乌延寿丹等，有壮筋骨、固精气、乌须发之功，亦可选择运用。`
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})